// ==========================================
// আমাদের এলাকা
// Bangladesh Division → District → Upazila
// ==========================================

const locationData = {

    "ঢাকা": {

        "ঢাকা": [
            "ধামরাই",
            "দোহার",
            "কেরাণীগঞ্জ",
            "নবাবগঞ্জ",
            "সাভার"
        ],

        "ফরিদপুর": [
            "আলফাডাঙ্গা",
            "ভাঙ্গা",
            "বোয়ালমারী",
            "চরভদ্রাসন",
            "ফরিদপুর সদর",
            "মধুখালী",
            "নগরকান্দা",
            "সদরপুর",
            "সালথা"
        ],

        "গাজীপুর": [
            "কালীগঞ্জ",
            "কালিয়াকৈর",
            "কাপাসিয়া",
            "গাজীপুর সদর",
            "শ্রীপুর"
        ],

        "গোপালগঞ্জ": [
            "গোপালগঞ্জ সদর",
            "কাশিয়ানী",
            "কোটালীপাড়া",
            "মুকসুদপুর",
            "টুঙ্গিপাড়া"
        ],

        "কিশোরগঞ্জ": [
            "অষ্টগ্রাম",
            "বাজিতপুর",
            "ভৈরব",
            "হোসেনপুর",
            "ইটনা",
            "করিমগঞ্জ",
            "কটিয়াদী",
            "কিশোরগঞ্জ সদর",
            "কুলিয়ারচর",
            "মিঠামইন",
            "নিকলী",
            "পাকুন্দিয়া",
            "তাড়াইল"
        ],

        "মাদারীপুর": [
            "মাদারীপুর সদর",
            "কালকিনি",
            "ডাসার",
            "রাজৈর",
            "শিবচর"
        ],

        "মানিকগঞ্জ": [
            "মানিকগঞ্জ সদর",
            "সাটুরিয়া",
            "শিবালয়",
            "ঘিওর",
            "দৌলতপুর",
            "হরিরামপুর",
            "সিংগাইর"
        ],

        "মুন্সিগঞ্জ": [
            "মুন্সিগঞ্জ সদর",
            "গজারিয়া",
            "টঙ্গীবাড়ী",
            "লৌহজং",
            "শ্রীনগর",
            "সিরাজদিখান"
        ],

        "নারায়ণগঞ্জ": [
            "আড়াইহাজার",
            "বন্দর",
            "নারায়ণগঞ্জ সদর",
            "রূপগঞ্জ",
            "সোনারগাঁ"
        ],

        "নরসিংদী": [
            "বেলাবো",
            "মনোহরদী",
            "নরসিংদী সদর",
            "পলাশ",
            "রায়পুরা",
            "শিবপুর"
        ],

        "রাজবাড়ী": [
            "বালিয়াকান্দি",
            "গোয়ালন্দ",
            "কালুখালী",
            "পাংশা",
            "রাজবাড়ী সদর"
        ],

        "শরীয়তপুর": [
            "ভেদরগঞ্জ",
            "ডামুড্যা",
            "গোসাইরহাট",
            "নড়িয়া",
            "শরীয়তপুর সদর",
            "জাজিরা"
        ],

        "টাঙ্গাইল": [
            "বাসাইল",
            "ভূঞাপুর",
            "দেলদুয়ার",
            "ধনবাড়ী",
            "ঘাটাইল",
            "গোপালপুর",
            "কালিহাতী",
            "মধুপুর",
            "মির্জাপুর",
            "নাগরপুর",
            "সখিপুর",
            "টাঙ্গাইল সদর"
        ]
    },


    "চট্টগ্রাম": {

        "বান্দরবান": [
            "বান্দরবান সদর",
            "আলীকদম",
            "নাইক্ষ্যংছড়ি",
            "রোয়াংছড়ি",
            "লামা",
            "রুমা",
            "থানচি"
        ],

        "ব্রাহ্মণবাড়িয়া": [
            "ব্রাহ্মণবাড়িয়া সদর",
            "কসবা",
            "নাসিরনগর",
            "সরাইল",
            "আশুগঞ্জ",
            "আখাউড়া",
            "নবীনগর",
            "বাঞ্ছারামপুর",
            "বিজয়নগর"
        ],

        "চাঁদপুর": [
            "চাঁদপুর সদর",
            "হাইমচর",
            "কচুয়া",
            "ফরিদগঞ্জ",
            "মতলব দক্ষিণ",
            "মতলব উত্তর",
            "শাহরাস্তি"
        ],

        "চট্টগ্রাম": [
            "আনোয়ারা",
            "বাঁশখালী",
            "বোয়ালখালী",
            "চন্দনাইশ",
            "ফটিকছড়ি",
            "হাটহাজারী",
            "লোহাগাড়া",
            "মীরসরাই",
            "পটিয়া",
            "রাঙ্গুনিয়া",
            "রাউজান",
            "সন্দ্বীপ",
            "সাতকানিয়া",
            "সীতাকুণ্ড",
            "কর্ণফুলী"
        ],

        "কুমিল্লা": [
            "দেবিদ্বার",
            "বরুড়া",
            "ব্রাহ্মণপাড়া",
            "চান্দিনা",
            "চৌদ্দগ্রাম",
            "দাউদকান্দি",
            "হোমনা",
            "লাকসাম",
            "মুরাদনগর",
            "নাঙ্গলকোট",
            "কুমিল্লা সদর",
            "মেঘনা",
            "মনোহরগঞ্জ",
            "সদর দক্ষিণ",
            "তিতাস",
            "বুড়িচং",
            "লালমাই"
        ],

        "কক্সবাজার": [
            "কক্সবাজার সদর",
            "চকরিয়া",
            "কুতুবদিয়া",
            "উখিয়া",
            "মহেশখালী",
            "পেকুয়া",
            "রামু",
            "টেকনাফ",
            "ঈদগাঁও",
            "মাতামুহুরী"
        ],

        "ফেনী": [
            "ছাগলনাইয়া",
            "ফেনী সদর",
            "সোনাগাজী",
            "ফুলগাজী",
            "পরশুরাম",
            "দাগনভূঞা"
        ],

        "খাগড়াছড়ি": [
            "খাগড়াছড়ি সদর",
            "দিঘীনালা",
            "পানছড়ি",
            "মহালছড়ি",
            "মাটিরাঙ্গা",
            "মানিকছড়ি",
            "রামগড়",
            "লক্ষ্মীছড়ি",
            "গুইমারা"
        ],

        "লক্ষ্মীপুর": [
            "লক্ষ্মীপুর সদর",
            "রায়পুর",
            "রামগঞ্জ",
            "রামগতি",
            "কমলনগর",
            "চন্দ্রগঞ্জ"
        ],

        "নোয়াখালী": [
            "নোয়াখালী সদর",
            "বেগমগঞ্জ",
            "চাটখিল",
            "কোম্পানীগঞ্জ",
            "সেনবাগ",
            "সুবর্ণচর",
            "হাতিয়া",
            "কবিরহাট",
            "সোনাইমুড়ী"
        ],

        "রাঙ্গামাটি": [
            "রাঙ্গামাটি সদর",
            "কাপ্তাই",
            "কাউখালী",
            "বাঘাইছড়ি",
            "বরকল",
            "বিলাইছড়ি",
            "জুরাছড়ি",
            "লংগদু",
            "নানিয়ারচর",
            "রাজস্থলী"
        ]
    },


    "রাজশাহী": {

        "বগুড়া": [
            "আদমদিঘি",
            "বগুড়া সদর",
            "ধুনট",
            "দুপচাঁচিয়া",
            "গাবতলী",
            "কাহালু",
            "নন্দিগ্রাম",
            "সারিয়াকান্দি",
            "শাজাহানপুর",
            "শেরপুর",
            "শিবগঞ্জ",
            "মোকামতলা"
        ],

        "জয়পুরহাট": [
            "আক্কেলপুর",
            "জয়পুরহাট সদর",
            "কালাই",
            "ক্ষেতলাল",
            "পাঁচবিবি"
        ],

        "নওগাঁ": [
            "আত্রাই",
            "বদলগাছী",
            "ধামইরহাট",
            "মান্দা",
            "মহাদেবপুর",
            "নওগাঁ সদর",
            "নিয়ামতপুর",
            "পত্নীতলা",
            "পোরশা",
            "রাণীনগর",
            "সাপাহার"
        ],

        "নাটোর": [
            "বাগাতিপাড়া",
            "বড়াইগ্রাম",
            "গুরুদাসপুর",
            "লালপুর",
            "নাটোর সদর",
            "সিংড়া",
            "নলডাঙ্গা"
        ],

        "চাঁপাইনবাবগঞ্জ": [
            "ভোলাহাট",
            "গোমস্তাপুর",
            "নাচোল",
            "চাঁপাইনবাবগঞ্জ সদর",
            "শিবগঞ্জ"
        ],

        "পাবনা": [
            "আটঘরিয়া",
            "বেড়া",
            "ভাঙ্গুড়া",
            "চাটমোহর",
            "ফরিদপুর",
            "ঈশ্বরদী",
            "পাবনা সদর",
            "সাঁথিয়া",
            "সুজানগর"
        ],

        "রাজশাহী": [
            "বাঘা",
            "বাগমারা",
            "চারঘাট",
            "দুর্গাপুর",
            "গোদাগাড়ী",
            "মোহনপুর",
            "পবা",
            "পুঠিয়া",
            "তানোর"
        ],

        "সিরাজগঞ্জ": [
            "বেলকুচি",
            "চৌহালি",
            "কামারখন্দ",
            "কাজীপুর",
            "রায়গঞ্জ",
            "শাহজাদপুর",
            "সিরাজগঞ্জ সদর",
            "তাড়াশ",
            "উল্লাপাড়া"
        ]
    },


    "খুলনা": {

        "বাগেরহাট": [
            "চিতলমারী",
            "ফকিরহাট",
            "কচুয়া",
            "মোল্লাহাট",
            "মোংলা",
            "মোরেলগঞ্জ",
            "রামপাল",
            "শরণখোলা",
            "বাগেরহাট সদর"
        ],

        "চুয়াডাঙ্গা": [
            "আলমডাঙ্গা",
            "চুয়াডাঙ্গা সদর",
            "দামুড়হুদা",
            "জীবননগর"
        ],

        "যশোর": [
            "অভয়নগর",
            "বাঘারপাড়া",
            "চৌগাছা",
            "ঝিকরগাছা",
            "কেশবপুর",
            "মণিরামপুর",
            "শার্শা",
            "যশোর সদর"
        ],

        "ঝিনাইদহ": [
            "ঝিনাইদহ সদর",
            "শৈলকুপা",
            "হরিণাকুণ্ডু",
            "কালীগঞ্জ",
            "কোটচাঁদপুর",
            "মহেশপুর"
        ],

        "খুলনা": [
            "বটিয়াঘাটা",
            "দাকোপ",
            "দিঘলিয়া",
            "ডুমুরিয়া",
            "কয়রা",
            "পাইকগাছা",
            "ফুলতলা",
            "রূপসা",
            "তেরখাদা"
        ],

        "কুষ্টিয়া": [
            "কুষ্টিয়া সদর",
            "কুমারখালী",
            "খোকসা",
            "মিরপুর",
            "দৌলতপুর",
            "ভেড়ামারা"
        ],

        "মাগুরা": [
            "মাগুরা সদর",
            "মহম্মদপুর",
            "শালিখা",
            "শ্রীপুর"
        ],

        "মেহেরপুর": [
            "মেহেরপুর সদর",
            "গাংনী",
            "মুজিবনগর"
        ],

        "নড়াইল": [
            "নড়াইল সদর",
            "লোহাগড়া",
            "কালিয়া"
        ],

        "সাতক্ষীরা": [
            "আশাশুনি",
            "দেবহাটা",
            "কলারোয়া",
            "কালিগঞ্জ",
            "সাতক্ষীরা সদর",
            "শ্যামনগর",
            "তালা"
        ]
    },


    "বরিশাল": {

        "বরগুনা": [
            "আমতলী",
            "বামনা",
            "বরগুনা সদর",
            "বেতাগী",
            "পাথরঘাটা",
            "তালতলী"
        ],

        "বরিশাল": [
            "আগৈলঝাড়া",
            "বাবুগঞ্জ",
            "বাকেরগঞ্জ",
            "বানারীপাড়া",
            "গৌরনদী",
            "হিজলা",
            "বরিশাল সদর",
            "মেহেন্দিগঞ্জ",
            "মুলাদী",
            "উজিরপুর"
        ],

        "ভোলা": [
            "ভোলা সদর",
            "বোরহানউদ্দিন",
            "চরফ্যাশন",
            "দৌলতখান",
            "লালমোহন",
            "মনপুরা",
            "তজুমদ্দিন"
        ],

        "ঝালকাঠি": [
            "ঝালকাঠি সদর",
            "কাঠালিয়া",
            "নলছিটি",
            "রাজাপুর"
        ],

        "পটুয়াখালী": [
            "বাউফল",
            "দশমিনা",
            "দুমকি",
            "কলাপাড়া",
            "মির্জাগঞ্জ",
            "পটুয়াখালী সদর",
            "গলাচিপা",
            "রাঙ্গাবালী"
        ],

        "পিরোজপুর": [
            "ভান্ডারিয়া",
            "কাউখালী",
            "মঠবাড়িয়া",
            "নাজিরপুর",
            "পিরোজপুর সদর",
            "নেছারাবাদ",
            "ইন্দুরকানী"
        ]
    },


    "সিলেট": {

        "হবিগঞ্জ": [
            "আজমিরীগঞ্জ",
            "বাহুবল",
            "বানিয়াচং",
            "চুনারুঘাট",
            "হবিগঞ্জ সদর",
            "লাখাই",
            "মাধবপুর",
            "নবীগঞ্জ",
            "শায়েস্তাগঞ্জ"
        ],

        "মৌলভীবাজার": [
            "বড়লেখা",
            "কমলগঞ্জ",
            "কুলাউড়া",
            "মৌলভীবাজার সদর",
            "রাজনগর",
            "শ্রীমঙ্গল",
            "জুড়ী"
        ],

        "সুনামগঞ্জ": [
            "বিশ্বম্ভরপুর",
            "ছাতক",
            "দিরাই",
            "ধর্মপাশা",
            "দোয়ারাবাজার",
            "জামালগঞ্জ",
            "জগন্নাথপুর",
            "শাল্লা",
            "সুনামগঞ্জ সদর",
            "তাহিরপুর",
            "শান্তিগঞ্জ",
            "মধ্যনগর"
        ],

        "সিলেট": [
            "বালাগঞ্জ",
            "বিয়ানীবাজার",
            "বিশ্বনাথ",
            "কোম্পানীগঞ্জ",
            "দক্ষিণ সুরমা",
            "ফেঞ্চুগঞ্জ",
            "গোলাপগঞ্জ",
            "গোয়াইনঘাট",
            "জৈন্তাপুর",
            "কানাইঘাট",
            "সিলেট সদর",
            "জকিগঞ্জ",
            "ওসমানী নগর"
        ]
    },


    "রংপুর": {

        "দিনাজপুর": [
            "নবাবগঞ্জ",
            "বীরগঞ্জ",
            "ঘোড়াঘাট",
            "বিরামপুর",
            "পার্বতীপুর",
            "বোচাগঞ্জ",
            "কাহারোল",
            "ফুলবাড়ী",
            "দিনাজপুর সদর",
            "হাকিমপুর",
            "খানসামা",
            "বিরল",
            "চিরিরবন্দর"
        ],

        "গাইবান্ধা": [
            "ফুলছড়ি",
            "গাইবান্ধা সদর",
            "গোবিন্দগঞ্জ",
            "পলাশবাড়ী",
            "সাদুল্লাপুর",
            "সাঘাটা",
            "সুন্দরগঞ্জ"
        ],

        "কুড়িগ্রাম": [
            "কুড়িগ্রাম সদর",
            "নাগেশ্বরী",
            "ভুরুঙ্গামারী",
            "ফুলবাড়ী",
            "রাজারহাট",
            "উলিপুর",
            "চিলমারী",
            "রৌমারী",
            "চর রাজিবপুর"
        ],

        "লালমনিরহাট": [
            "লালমনিরহাট সদর",
            "আদিতমারী",
            "কালীগঞ্জ",
            "হাতীবান্ধা",
            "পাটগ্রাম"
        ],

        "নীলফামারী": [
            "নীলফামারী সদর",
            "ডোমার",
            "ডিমলা",
            "জলঢাকা",
            "কিশোরগঞ্জ",
            "সৈয়দপুর"
        ],

        "পঞ্চগড়": [
            "আটোয়ারী",
            "বোদা",
            "দেবীগঞ্জ",
            "পঞ্চগড় সদর",
            "তেঁতুলিয়া"
        ],

        "রংপুর": [
            "বদরগঞ্জ",
            "কাউনিয়া",
            "রংপুর সদর",
            "মিঠাপুকুর",
            "পীরগাছা",
            "পীরগঞ্জ",
            "তারাগঞ্জ",
            "গংগাচড়া"
        ],

        "ঠাকুরগাঁও": [
            "পীরগঞ্জ",
            "বালিয়াডাঙ্গী",
            "হরিপুর",
            "রাণীশংকৈল",
            "ঠাকুরগাঁও সদর",
            "ভূল্লী",
            "রুহিয়া"
        ]
    },


    "ময়মনসিংহ": {

        "জামালপুর": [
            "জামালপুর সদর",
            "মেলান্দহ",
            "ইসলামপুর",
            "দেওয়ানগঞ্জ",
            "সরিষাবাড়ী",
            "মাদারগঞ্জ",
            "বকশীগঞ্জ"
        ],

        "ময়মনসিংহ": [
            "ফুলবাড়ীয়া",
            "ত্রিশাল",
            "ভালুকা",
            "মুক্তাগাছা",
            "ময়মনসিংহ সদর",
            "ধোবাউড়া",
            "ফুলপুর",
            "হালুয়াঘাট",
            "গৌরীপুর",
            "গফরগাঁও",
            "ঈশ্বরগঞ্জ",
            "নান্দাইল",
            "তারাকান্দা"
        ],

        "নেত্রকোণা": [
            "আটপাড়া",
            "বারহাট্টা",
            "দুর্গাপুর",
            "খালিয়াজুরী",
            "কলমাকান্দা",
            "কেন্দুয়া",
            "মদন",
            "মোহনগঞ্জ",
            "নেত্রকোণা সদর",
            "পূর্বধলা"
        ],

        "শেরপুর": [
            "শেরপুর সদর",
            "নালিতাবাড়ী",
            "শ্রীবরদী",
            "নকলা",
            "ঝিনাইগাতী"
        ]
    }

};


// ==========================================
// Make locationData globally accessible
// ==========================================

window.locationData = locationData;
