// =====================================
// Bangladesh Location Data
// =====================================

const locationData = {
    "ঢাকা": {
        "ঢাকা": [
            "ধামরাই",
            "দোহার",
            "কেরানীগঞ্জ",
            "নবাবগঞ্জ",
            "সাভার"
        ],
        "গাজীপুর": [
            "কালিয়াকৈর",
            "কালীগঞ্জ",
            "কাপাসিয়া",
            "শ্রীপুর",
            "গাজীপুর সদর"
        ]
    },

    "রংপুর": {
        "রংপুর": [
            "রংপুর সদর",
            "গঙ্গাচড়া",
            "তারাগঞ্জ",
            "বদরগঞ্জ",
            "মিঠাপুকুর",
            "পীরগঞ্জ",
            "কাউনিয়া",
            "পীরগাছা"
        ],
        "দিনাজপুর": [
            "দিনাজপুর সদর",
            "বিরল",
            "বীরগঞ্জ",
            "বোচাগঞ্জ",
            "চিরিরবন্দর",
            "ফুলবাড়ী",
            "ঘোড়াঘাট",
            "হাকিমপুর",
            "কাহারোল",
            "খানসামা",
            "নবাবগঞ্জ",
            "পার্বতীপুর"
        ]
    },

    "চট্টগ্রাম": {},
    "রাজশাহী": {},
    "খুলনা": {},
    "বরিশাল": {},
    "সিলেট": {},
    "ময়মনসিংহ": {}
};
